routes/web.php

Route::get('/posts/{comic:slug}', [ComicController::class, 'show']);

Route::get('/categories', function () {
    return view('categories', [
        'title' => 'Category',
        "active" => 'category',
        'categories' => Category::all()
    ]);
---
SELECT * FROM `categories`