app/Http/Controllers/AdminCategoryController.php

SELECT * FROM `categories`
---
    public function index()
    {
        $this->authorize('admin');
        return view('dashboard.categories.index', [
            'categories' => Category::all()
        ]);

SELECT * FROM `categories`
---
    public function create()
    {
        return view('dashboard.categories.create', [
            'categories' => Category::all()
        ]);

INSERT INTO `categories` (`name`, `slug`, `updated_at`, `created_at`) VALUES ('Horor', 'horor', '2022-11-17 03:58:14', '2022-11-17 03:58:14')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'slug' => 'required|unique:comics',
        ]);

        Category::create($validatedData);

SELECT * FROM `categories` WHERE `id` in (5)
UPDATE `categories` SET `name` = 'Horor 3', `slug` = 'horor3', `categories`.`updated_at` = '2022-11-24 03:53:00' WHERE `id` = 4
---
    public function update(Request $request, Category $category)
    {
        $rules = [
            'name' => 'required|max:255'
        ];

        if ($request->slug != $category->slug) {
            $rules['slug'] = 'required|unique:comics';
        }

        $validatedData = $request->validate($rules);

        Category::where('id', $category->id)->update($validatedData);

DELETE FROM `categories` WHERE `id` = 5
---
    public function destroy(Category $category)
    {
        Category::destroy($category->id);