app/Http/Controllers/ComicController.php

SELECT * FROM `categories` WHERE `slug` = 'comedy' LIMIT 1
SELECT * FROM `users` WHERE `username` = 'prasetyo.zelda' LIMIT 1
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `comics` ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `comics`
---
    public function index()
    {
        $title = '';
        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in ' . $category->name;
        }

        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' by ' . $author->name;
        }

        return view('posts', [
            "title" => "Comics" . $title,
            "active" => "comics",
            "comics" => Comic::latest()->filter(request(['search', 'category', 'author']))->paginate(10)->withQueryString()