app/Http/Controllers/DashboardComicController.php

    public function index()
    {
        return view('dashboard.comics.index', [
            'comics' => Comic::where('user_id', auth()->user()->id)->get()
        ]);
---
SELECT * FROM `comics` WHERE `user_id` = 1

    public function create()
    {
        return view('dashboard.comics.create', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'title' => 'required|max:255',
            'slug' => 'required|unique:comics',
            'category_id' => 'required',
            'excerpt' => 'required|max:255',
            'image' => 'image',
            'pages' => 'required'
        ]);

        if ($request->file('image')) {
            $validatedData['image'] = $request->file('image')->store('comic-images');
        }

        $validatedData['excerpt'] = strip_tags($validatedData['excerpt']);
        $validatedData['user_id'] = auth()->user()->id;

        Comic::create($validatedData);
---
INSERT INTO `comics` (`title`, `slug`, `category_id`, `excerpt`, `image`, `pages`, `user_id`, `updated_at`, `created_at`) VALUES ('Attack on Titan episode 1', 'attack-on-titan-episode-1', '3', 'Ini adalah deskripsi komik attack on titan 1', 'comic-images/yoqpcMiIpN9Yu6vdkKXcedgQlKsL0qB0sxrXUaMz.jpg', '10', 1, '2022-11-24 03:21:27', '2022-11-24 03:21:27')

    public function edit(Comic $comic)
    {
        return view('dashboard.comics.edit', [
            'comic' => $comic,
            'categories' => Category::all()
---
SELECT * FROM `categories`

    public function update(Request $request, Comic $comic)
    {
        $rules = [
            'title' => 'required|max:255',
            'category_id' => 'required',
            'excerpt' => 'required|max:255',
            'image' => 'image',
            'pages' => 'required'
        ];

        if ($request->slug != $comic->slug) {
            $rules['slug'] = 'required|unique:comics';
        }

        $validatedData = $request->validate($rules);

        if ($request->file('image')) {
            $validatedData['image'] = $request->file('image')->store('comic-images');
            if ($request->oldImage) {
                Storage::delete($request->oldImage);
            }
        }

        $validatedData['excerpt'] = strip_tags($validatedData['excerpt']);
        $validatedData['user_id'] = auth()->user()->id;

        Comic::where('id', $comic->id)->update($validatedData);
---
UPDATE `comics` SET `title` = 'Attack on Titan episode 4', `category_id` = '1', `excerpt` = 'Ini&nbsp; deskripsi komik 4 terbaru', `pages` = '16', `slug` = 'attack-on-titan-episode-4', `user_id` = 8, `comics`.`updated_at` = '2022-11-24 03:50:50' WHERE `id` = 41

    public function destroy(Comic $comic)
    {
        if ($comic->image) {
            Storage::delete($comic->image);
        }
        Comic::destroy($comic->id);

        return redirect('/dashboard/comics')->with('success', 'Comic Category deleted!');
---
DELETE FROM `comics` WHERE `id` = 41
SELECT * FROM `comics` WHERE `id` in (41)