app/Http/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('user', 'userpertama', 'userpertama@gmail.com', '$2y$10$UD0D1VIbwF8302xKab4lE.OxQv2lTNzA6qnGCvzL5wKT18AUjtDz6', '2022-11-24 03:41:07', '2022-11-24 03:41:07')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:5|max:255|unique:users',
            'email' => 'required|email:dns|unique:users|',
            'password' => 'required|min:5|max:255'
        ]);

        $validatedData['password'] = Hash::make($validatedData['password']);

        User::create($validatedData);